<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

## Guided Practice: Inspecting Data Types and Applying Functions

_Authors: Dave Yerrington (SF)_

---

In [1]:
import pandas as pd
import numpy as np

**1. Create a small DataFrame with different data types (provided).**

In [2]:
# create a small dictionary with different data types

dft = pd.DataFrame(dict(A = np.random.rand(3),
                        B = 1,
                        C = 'foo',
                        D = pd.Timestamp('20010102'),
                        E = pd.Series([1.0]*3).astype('float32'),
                                F = False,
                                G = pd.Series([1]*3,dtype='int8')))

dft

          A  B    C          D    E      F  G
0  0.378283  1  foo 2001-01-02  1.0  False  1
1  0.678717  1  foo 2001-01-02  1.0  False  1
2  0.691731  1  foo 2001-01-02  1.0  False  1

**2. Examine the data types of the columns.**

In [3]:
# A:

**3. Create a Series object with the integers 1-5 and float 6.0. What data type is the Series?**

In [4]:
# A:

**4. Create a Series with data: `[1, 2, 3, 6., 'foo']`. What data type is the series?**

In [5]:
# A:

**5. Find how many columns of each type there are with the `.get_dtype_counts()` function.**

In [6]:
# A:

**6. Create another small DataFrame (provided).**

In [7]:
# create a small data frame. 
df = pd.DataFrame(np.random.randn(5, 4), columns=['a', 'b', 'c', 'd'])

**7. Use the `.apply()` function to find the square root of all the cells.**

In [8]:
# A:

**8. Use `.apply()` to find the mean of the columns.**

In [9]:
# A:

**9. Find the mean of the rows.**

In [10]:
# A:

**10. Use numpy to create a random vector of 50 numbers ranging from 0 to 6.**

*Hint: This can be done with `np.random.randint()`.

In [11]:
# A:

**11. Convert the vector to a Series and count the occurrences of each number.**

In [12]:
# A:

---

# Independent practice: sales data

---
**1. Load the `sales.csv` data set from the datasets directory.**

In [57]:
# A:
sales_df = pd.read_csv('datasets/sales.csv')
sales_df.head()

   volume_sold  2015_margin  2015_q1_sales  2016_q1_sales
0    18.420760    93.802281      337166.53      337804.05
1     4.776510    21.082425       22351.86       21736.63
2    16.602401    93.612494      277764.46      306942.27
3     4.296111    16.824704       16805.11        9307.75
4     8.156023    35.011457       54411.42       58939.90

**2. Inspect the data types.**

In [58]:
# A:
sales_df.dtypes

volume_sold      float64
2015_margin      float64
2015_q1_sales    float64
2016_q1_sales    float64
dtype: object

**3. Imagine you've found out that all your values in the first column are off by 1. Use `.apply()` or `.map()` to add 1 to the first column of the dataset.**

In [59]:
# A:
sales_df['volume_sold'] = sales_df['volume_sold'].map(lambda x: x+1)
sales_df.head()

   volume_sold  2015_margin  2015_q1_sales  2016_q1_sales
0    19.420760    93.802281      337166.53      337804.05
1     5.776510    21.082425       22351.86       21736.63
2    17.602401    93.612494      277764.46      306942.27
3     5.296111    16.824704       16805.11        9307.75
4     9.156023    35.011457       54411.42       58939.90

**4. Use `.value_counts` to count the values of the first column of the dataset.**

In [61]:
# A:
sales_df['volume_sold'].value_counts()

17.059971    1
12.232324    1
7.290971     1
14.635150    1
6.047530     1
6.906274     1
7.618174     1
10.292241    1
5.200122     1
4.210727     1
12.997117    1
8.200364     1
46.556096    1
6.778097     1
5.385455     1
11.804337    1
9.017945     1
16.697651    1
7.654407     1
9.300180     1
7.537069     1
7.433606     1
5.776510     1
11.186622    1
9.156023     1
6.531061     1
6.294400     1
12.697456    1
15.439435    1
8.390988     1
            ..
8.682494     1
10.127095    1
11.292681    1
6.324497     1
5.296111     1
10.348477    1
13.581695    1
13.395919    1
52.800686    1
12.625606    1
11.677295    1
11.252870    1
5.941294     1
15.606750    1
30.878030    1
11.331430    1
8.434821     1
8.196779     1
8.785867     1
12.091709    1
13.509967    1
6.147729     1
13.350027    1
6.388070     1
9.555078     1
12.840780    1
6.723896     1
8.437252     1
5.456466     1
11.705327    1
Name: volume_sold, Length: 200, dtype: int64

**BONUS: The `.value_counts()` output in question four isn't very insightful.  Use [Pandas.DataFrame.round](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.round.html) to round the column to the nearest tenth before runing `.value_counts()`.**

In [62]:
# A:
sales_df['volume_sold'].round(1).value_counts()

7.3     7
11.3    6
9.6     6
8.8     6
8.4     5
10.3    5
5.8     4
11.1    4
6.2     4
11.7    3
6.9     3
8.2     3
8.6     3
9.2     3
5.4     3
9.5     3
6.8     3
7.7     3
13.5    3
7.0     3
9.8     3
6.0     3
11.6    3
5.9     3
12.1    3
9.4     3
9.1     3
10.2    2
10.4    2
8.7     2
       ..
13.1    1
4.2     1
7.1     1
19.7    1
15.6    1
5.3     1
11.9    1
56.7    1
77.2    1
7.2     1
51.3    1
3.8     1
52.8    1
17.1    1
4.1     1
4.6     1
10.9    1
10.7    1
30.9    1
9.7     1
10.1    1
14.8    1
6.4     1
4.7     1
46.6    1
5.6     1
52.7    1
17.6    1
19.4    1
12.2    1
Name: volume_sold, Length: 99, dtype: int64